/* Format string for the message body of the dialog displayed when a format operation has completed successfully. The argument %1$@ is the SD card type, i.e. \"SD\", \"SDHC\" or \"SDXC\". */
"%1$@ formatting was successfully completed.\n\nVolume information:\nFile system: %2$@\nCapacity: %3$@ (%4$@ bytes)\nFree space: %5$@ (%6$@ bytes)\nCluster size: %7$@ bytes\nVolume label: %8$@" = "%1$@ formatting was successfully completed.\n\nVolume information:\nFile system: %2$@\nCapacity: %3$@ (%4$@ bytes)\nFree space: %5$@ (%6$@ bytes)\nCluster size: %7$@ bytes\nVolume label: %8$@";

/* Format string for message body of the dialog displayed when there is a new version of the application available. The argument %1$@ is the version number of the new version, e.g. \"5.0.1\". */
"An update is available: SD Card Formatter %@\nDo you want to update?" = "An update is available: SD Card Formatter %@\nDo you want to update?";

/* 'Cancel' label on format button.
   Title of the \"Cancel\" button in the dialog displayed to confirm that we should initiate a format operation for the selected card. */
"Cancel" = "Cancel";

/* Title of the dialog displayed to request confirmation for cancelling a format operation. */
"Cancel format" = "Cancel format";

/* Message body of the dialog displayed when a user attempts to format a write-protected card. */
"Cannot format write protected card." = "Cannot format write protected card.";

/* Format string for the message body of the dialog displayed when the volume label contains invalid characters. The argument %1$lu is the index of the first invalid character in the volume label and the argument %2$@ is the actual invalid character. %3$@ is the space-separated list of invalid characters for this filesystem. */
"Character %lu in volume label is invalid: %@\n\nThe volume label cannot contain the following characters:\n %@" = "Character %1$lu in volume label is invalid: %2$@\n\nThe volume label cannot contain the following characters:\n %3$@";

/* Title of the dialog displayed when a user attempts to close the application while a format operation is in progress. */
"Closing application" = "Closing application";

/* Message body of the dialog displayed when a user attempts to close the application while a format operation is in progress. */
"Closing the application will cancel formatting.\nDo you want to continue?" = "Closing the application will cancel formatting.\nDo you want to continue?";

/* Title of the \"Continue\" button in the dialog displayed to confirm that we should initiate a format operation for the selected card. */
"Continue" = "Continue";

/* Message body of dialog displayed when an error was encountered while fetching the latest version info from the version URL. */
"Could not check for updates.\nPlease verify that the computer is connected to the Internet." = "Could not check for updates.\nPlease verify that the computer is connected to the Internet.";

/* Message body of the dialog displayed to request confirmation for cancelling a format operation. */
"Do you want to cancel formatting?" = "Do you want to cancel formatting?";

/* Title of the \"Download update\" button in the dialog displayed when there is a new version of the application available. */
"Download update" = "Download update";

/* Generic title/header for error dialogs. */
"Error" = "Error";

/* 'Format' label on format button. */
"Format" = "Format";

/* Title of the dialog displayed when a format operation has been canceled by the user. */
"Format canceled" = "Format canceled";

/* Title of the dialog displayed when a format operation has completed successfully. */
"Format complete" = "Format complete";

/* Title of the dialog displayed to confirm that we should initiate a format operation for the selected card. */
"Format SD card" = "Format SD card";

/* Message body of the dialog displayed when a format operation has been canceled by the user. */
"Formatting has been cancelled." = "Formatting has been cancelled.";

/* Message body of the dialog displayed to confirm that we should initiate a format operation for the selected card. */
"Formatting will erase all data on this card.\nDo you want to continue?\n\nNote: As formatting can take some time (especially when overwrite option is selected), please make sure that your computer is connected to a power supply and that sleep mode is disabled." = "Formatting will erase all data on this card.\nDo you want to continue?\n\nNote: As formatting can take some time (especially when overwrite option is selected), please make sure that your computer is connected to a power supply and that sleep mode is disabled.";

/* Title of the \"Ignore\" button in the dialog displayed when there is a new version of the application available. */
"Ignore" = "Ignore";

/* Title of the \"No\" button in the dialog displayed to request confirmation for cancelling a format operation.
   Title of the \"No\" button in the dialog displayed when a user attempts to close the application while a format operation is in progress. */
"No" = "No";

/* Title of the dialog displayed when there is no new version of the application available. */
"No update available" = "No update available";

/* Generic title of an \"OK\" button closing a message dialog. */
"OK" = "OK";

/* Prefix for the progress percentage displayed next to the format button during a format operation. */
"Progress:" = "Progress:";

/* Message body of the dialog displayed when there is no new version of the application available. */
"The application is up to date." = "The application is up to date.";

/* Message body of the dialog displayed when a card has been removed during a format operation. */
"The selected card is no longer available." = "Unable to complete format.\nReinsert the card and format again.";

/* Format string for the message body of the dialog displayed when there was an error when unmounting all volumes on the card prior to formatting. The argument %1$s is the disk identifier, e.g. \"disk1\" and the argument %2$@ is the system-provided error message for the failure. */
"Unable to unmount volumes on %1$s: %2$@" = "Unable to unmount volumes on %1$s: %2$@";

/* Title of the dialog displayed when there is a new version of the application available. */
"Update available" = "Update available";

/* Format string for the message body of the dialog displayed when the volume label of an SD/SDHC card is too long. The argument %zu is the number of bytes that the label occupies when converted to the appropriate OEM codepage representation. */
"Volume label is too long: %zu OEM bytes (Max 11 OEM bytes allowed.)" = "Volume label is too long: %zu OEM bytes (Max 11 OEM bytes allowed.)";

/* Format string for the message body of the dialog displayed when the volume label of an SDXC card is too long. The argument %zu is the number of UTF-16 units that the label occupies when converted to UTF-16LE. */
"Volume label is too long: %zu UTF-16 units (Max 11 UTF-16 units allowed.)" = "Volume label is too long: %zu UTF-16 units (Max 11 UTF-16 units allowed.)";

/* Title of the \"Yes\" button in the dialog displayed to request confirmation for cancelling a format operation.
   Title of the \"Yes\" button in the dialog displayed when a user attempts to close the application while a format operation is in progress. */
"Yes" = "Yes";

/* No comment provided by engineer. */
/* "You are currently running the latest version of SD Card Formatter." = "You are currently running the latest version of SD Card Formatter."; */

